src/cf/Documents/уатОтчетСистемыПлатон.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>уатОтчетСистемыПлатон</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Comment>Договор контрагента</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Произвольный комментарий</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Расходы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>УникальныйНомерОперации</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОперации</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипОперации</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатТипыОперацийПлатон</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГРЗТС</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТСОтчета</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПутьПройденныйТС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗачислениеНаРЗ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СписаниеСРЗ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерБУМК</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаВремяНачалаДвижения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаВремяОкончанияДвижения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеАвтомобильнойДороги</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЛатВъездаНаТарифицируемыйУчасток</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>21</v8:Digits>
									<v8:FractionDigits>17</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЛонВъездаНаТарифицируемыйУчасток</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>21</v8:Digits>
									<v8:FractionDigits>17</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЛатСъездаСТарифицируемогоУчастка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>21</v8:Digits>
									<v8:FractionDigits>17</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЛонСъездаСТарифицируемогоУчастка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>21</v8:Digits>
									<v8:FractionDigits>17</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/InformationRegisters/уатИсторияЗакрепленияБортовыхУстройств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>уатИсторияЗакрепленияБортовыхУстройств</Name>
			<Comment>История закрепления бортовых устройств учета платных дорог на транспортном средстве</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НомерБортовогоУстройства</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВнешняяСистема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатВнешниеСистемы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/уатПринадлежностьТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>уатПринадлежностьТС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Собственное</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Привлеченное</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Виртуальное</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ВидыДоговоровКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыДоговоровКонтрагентов</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СПоставщиком</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СПокупателем</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомитентом</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомиссионером</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомитентомНаЗакупку</Name>
					<Comment>Используется для обмена с типовыми конфигурациями</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомиссионеромНаЗакупку</Name>
					<Comment>Используется для обмена с типовыми конфигурациями</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Documents/уатОтчетСистемыПлатон/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	уатЗащищенныеФункцииСервер.уатДокументФормаЭлементаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, Объект, ЭтотОбъект, ДопПараметрыОткрытие);
	Если Отказ тогда
		Возврат;
	КонецЕсли;
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	АвторизованныйПользователь = ПользователиКлиентСервер.АвторизованныйПользователь();
	Если ТипЗнч(АвторизованныйПользователь) = Тип("СправочникСсылка.ВнешниеПользователи") Тогда 
		Если Параметры.Ключ.Пустая() Тогда 
			Объект.Ответственный = АвторизованныйПользователь;
			
			Если ТипЗнч(АвторизованныйПользователь.ОбъектАвторизации) = Тип("СправочникСсылка.КонтактныеЛица") 
					И ТипЗнч(АвторизованныйПользователь.ОбъектАвторизации.ОбъектВладелец) = Тип("СправочникСсылка.Контрагенты") Тогда 
				Объект.Контрагент = АвторизованныйПользователь.ОбъектАвторизации.ОбъектВладелец;
			ИначеЕсли ТипЗнч(АвторизованныйПользователь.ОбъектАвторизации) = Тип("СправочникСсылка.Контрагенты") Тогда 
				Объект.Контрагент = АвторизованныйПользователь.ОбъектАвторизации;
			КонецЕсли;
		КонецЕсли;
		
		Элементы.Ответственный.Доступность	 = Ложь;
		Элементы.Контрагент.Доступность		 = Ложь;
	КонецЕсли;
	
	Если Не ПравоДоступа("Редактирование", Метаданные.Справочники.уатТС) Тогда
		Элементы.РасходыЗаполнитьНомерБортовогоУстройстваТС.Видимость = Ложь;
	КонецЕсли;
	
	// уатУправлениеАвтотранспортом.МодификацияКонфигурации
	уатМодификацияКонфигурацииПереопределяемый.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	// Конец уатУправлениеАвтотранспортом.МодификацияКонфигурации
	
	УстановитьСвязиПараметровВыбора();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// уатУправлениеАвтотранспортом.МодификацияКонфигурации
	уатМодификацияКонфигурацииКлиентПереопределяемый.ПриОткрытии(ЭтотОбъект, Отказ);
	// Конец уатУправлениеАвтотранспортом.МодификацияКонфигурации
	
	уатЗащищенныеФункцииКлиент.уатДокументФормаЭлементаПриОткрытии(Отказ, ЭтотОбъект, ДопПараметрыОткрытие);
	Если Отказ тогда
		Возврат;
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(Элемент.ТекстРедактирования, ЭтотОбъект, "Объект.Комментарий");
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	КонтрагентПередИзменением = Контрагент;
	Контрагент = Объект.Контрагент;
	
	Если КонтрагентПередИзменением <> Объект.Контрагент Тогда
		ПриИзмененииКонтрагентаИлиОрганизации();
	КонецЕсли;

	
КонецПроцедуры

&НаКлиенте
Процедура ДоговорКонтрагентаПриИзменении(Элемент)
	
	ДоговорПередИзменением = Договор;
	Договор = Объект.ДоговорКонтрагента;
	
	Если ДоговорПередИзменением <> Объект.ДоговорКонтрагента Тогда
		
		ПриИзмененииДоговора();
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	Если Объект.Организация = ОрганизацияПередИзменением Тогда
		Возврат;
	КонецЕсли;
	ОрганизацияПередИзменением = Объект.Организация;
	
	ПриИзмененииКонтрагентаИлиОрганизации();

КонецПроцедуры

&НаКлиенте
Процедура РасходыТСПриИзменении(Элемент)
	ТекСтрока = Элементы.Расходы.ТекущиеДанные;
	Если ТекСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекСтрока.ТС)
		И ТипЗнч(ТекСтрока.ТС) = Тип("СправочникСсылка.уатТС")
		И уатОбщегоНазначенияТиповые.ПолучитьЗначениеРеквизита(ТекСтрока.ТС, "ПринадлежностьТС")
		= ПредопределенноеЗначение("Перечисление.уатПринадлежностьТС.Собственное") Тогда
		МестонахождениеТС = уатОбщегоНазначения.МестонахождениеТС(ТекСтрока.ТС, ТекСтрока.ДатаОперации);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДоговорКонтрагентаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	мВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СПоставщиком");
	
	уатОбщегоНазначенияТиповыеКлиент.уатНачалоВыбораЗначенияДоговораКонтрагента(Объект, ЭтотОбъект, Элемент, Объект.Контрагент, 
		Объект.ДоговорКонтрагента, мВидДоговора, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ДоговорКонтрагентаСоздание(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ВидДоговораДоступныеЗначения = Новый Массив;
	
	мВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СПоставщиком");
	ВидДоговораДоступныеЗначения.Добавить(мВидДоговора);
	
	ПараметрыФормы = Новый Структура();  
	ПараметрыФормы.Вставить("Владелец", Объект.Контрагент);
	ПараметрыФормы.Вставить("ВидДоговораДоступныеЗначения", ВидДоговораДоступныеЗначения);
	ОткрытьФорму("Справочник.ДоговорыКонтрагентов.ФормаОбъекта", ПараметрыФормы, ЭтотОбъект);
КонецПроцедуры  

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// уатУправлениеАвтотранспортом.МодификацияКонфигурации
&НаКлиенте
Процедура Подключаемый_уатВыполнитьКоманду(Команда)
	
	уатМодификацияКонфигурацииКлиентПереопределяемый.ВыполнитьПодключаемуюКоманду(ЭтотОбъект, Команда);
	
КонецПроцедуры
// Конец уатУправлениеАвтотранспортом.МодификацияКонфигурации

&НаКлиенте
Процедура ОткрытьКарту(Команда)
	
	ТекДанные = Элементы.Расходы.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Параметры.Ключ.Пустая() Или Модифицированность Тогда 
		ТекстВопроса = НСтр("en='Before opening form of map, you need to record changes.';ru='Перед открытием формы карты необходимо записать изменения.'") + Символы.ПС + НСтр("en='Save?';ru='Сохранить?'");
		Оповещение = Новый ОписаниеОповещения("ОткрытьКартуСохранитьИзменения", ЭтотОбъект, Новый Структура("ТекДанные", ТекДанные));
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	Иначе 
		ОткрытьФормуКарты(ТекДанные);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНомерБортовогоУстройстваТС(Команда)
	ЗаполнитьНомерБортовогоУстройстваТССервер(Объект.Расходы);
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьОтчеты(Команда)
	
	Если Объект.Расходы.Количество() > 0 Тогда
		ТекстНСТР = НСтр("en='Clear refueling table before download?';ru='Очистить таблицу расходов перед загрузкой?'");
		ПоказатьВопрос(Новый ОписаниеОповещения("ЗагрузитьОтчетыИзФайлаВопрос", ЭтотОбъект),
		ТекстНСТР, РежимДиалогаВопрос.ДаНетОтмена);
		Возврат;
	КонецЕсли;
	
	ЗагрузитьОтчетыИзФайлаПродолжение();

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТСПоНомеруУстройства(Команда)
	
	Для Каждого ТекСтрока Из Объект.Расходы Цикл
		
		ТекСтрока.ТС = НайтиТСПоНомеруУстройства(ТекСтрока.ДатаОперации, ТекСтрока.НомерБУМК);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура ЗагрузитьОтчетыИзФайлаВопрос(РезультатВопроса, ДополнительныеПараметры) Экспорт
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Объект.Расходы.Очистить();
	ИначеЕсли РезультатВопроса = КодВозвратаДиалога.Нет Тогда
	Иначе
		Возврат;
	КонецЕсли;
	
	ЗагрузитьОтчетыИзФайлаПродолжение(); 
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьОтчетыИзФайлаПродолжение()
	Попытка
		ПараметрыОткрытия = Новый Структура();
		ОткрытьФорму("Документ.уатОтчетСистемыПлатон.Форма.ФормаЗагрузки",ПараметрыОткрытия,ЭтотОбъект,,,, Новый ОписаниеОповещения("ЗагрузитьОтчетыИзФайлаЗавершение", ЭтотОбъект),
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Исключение
		ТекстНСТР = НСтр("ru = 'Ошибка при заполнении табличной части ""Расходы"": '; en = 'Error while filling tabular section ""Refueling"": '");
		ТекстНСТР = ТекстНСТР + ОписаниеОшибки();
		ПоказатьПредупреждение(Неопределено, ТекстНСТР);
		Возврат;
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьОтчетыИзФайлаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено И ТипЗнч(Результат) = Тип("Массив") И Результат.Количество() > 0 Тогда 
		ТипОперацииСсылка = ПредопределенноеЗначение("Справочник.уатТипыОперацийПлатон.ПустаяСсылка");
		ТипОперацииСоответствие = Новый Соответствие();
		ТипОперацииМассив       = Новый Массив();
		Для Каждого ТекСтрока Из Результат Цикл
			Если ТекСтрока.Свойство("ТипОперации") 
				И ЗначениеЗаполнено(ТекСтрока.ТипОперации)
				И ТипОперацииМассив.Найти(ТекСтрока.ТипОперации) = Неопределено Тогда
				ТипОперацииСоответствие.Вставить(ТекСтрока.ТипОперации, ТипОперацииСсылка);
				ТипОперацииМассив.Добавить(ТекСтрока.ТипОперации);
			КонецЕсли;
		КонецЦикла;
		НайтиСоздатьОперациюПлатон(ТипОперацииМассив, ТипОперацииСоответствие);
		
		МассивТС = Новый Массив();
		Для Каждого ТекСтрока Из Результат Цикл
			Если ТекСтрока.Свойство("НомерБУМК") Тогда
				МассивТС.Добавить(ТекСтрока.НомерБУМК);
			КонецЕсли;
		КонецЦикла;
		СтруктураДанных             = ПолучитьСоответвиеТСПоНомерамУстройств(МассивТС);
		СоответвиеБортовыхУстройств = СтруктураДанных.СоответвиеБортовыхУстройств;
		Для Каждого ТекСтрока Из Результат Цикл
			Если ТекСтрока.Свойство("ТипОперации") Тогда
				ТипОперации = ТипОперацииСоответствие.Получить(ТекСтрока.ТипОперации);
			КонецЕсли;
			ТС = Неопределено;
			Если ТекСтрока.Свойство("НомерБУМК") Тогда
				Если ТекСтрока.Свойство("ДатаОперации") Тогда
					ДатаОперации = ТекСтрока.ДатаОперации;
				Иначе
					ДатаОперации = ТекущаяДата();
				КонецЕсли;
				Если НЕ ЗначениеЗаполнено(ДатаОперации) Тогда
					ДатаОперации = ТекущаяДата();
				КонецЕсли; 
				
				CоответвиеДат = СоответвиеБортовыхУстройств.Получить(ТекСтрока.НомерБУМК); 
				Если CоответвиеДат <> Неопределено Тогда
					ТекПериод = Неопределено;
					Для Каждого ТекСтрокаПериод Из CоответвиеДат Цикл
						Если ТекСтрокаПериод.Ключ <= ДатаОперации Тогда 
							Если ТекПериод = Неопределено Тогда
								ТекПериод = ТекСтрокаПериод.Ключ;
							Иначе
								ТекПериод = Макс(ТекПериод, ТекСтрокаПериод.Ключ); 
							КонецЕсли;
						КонецЕсли;
					КонецЦикла;
					Если ТекПериод <> Неопределено Тогда
						ТС = CоответвиеДат.Получить(ТекПериод);
						// Проверим, что у ТС не изменился номер БУ  
						СоответвиеТС  = СтруктураДанных.СоответвиеТС;
						CоответвиеДат = СоответвиеТС.Получить(ТС); 
						Если CоответвиеДат <> Неопределено Тогда
							ТекПериод = Неопределено;
							Для Каждого ТекСтрокаПериод Из CоответвиеДат Цикл
								Если ТекСтрокаПериод.Ключ <= ДатаОперации Тогда 
									Если ТекПериод = Неопределено Тогда
										ТекПериод = ТекСтрокаПериод.Ключ;
									Иначе
										ТекПериод = Макс(ТекПериод, ТекСтрокаПериод.Ключ); 
									КонецЕсли;
								КонецЕсли;
							КонецЦикла; 
							Если ТекПериод <> Неопределено Тогда
								НомерБУМК = CоответвиеДат.Получить(ТекПериод);
								Если НомерБУМК <> ТекСтрока.НомерБУМК Тогда
									ТС = Неопределено;
								КонецЕсли;
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			НоваяЗаправка = Объект.Расходы.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяЗаправка, ТекСтрока); 
			НоваяЗаправка.НомерСтрокиФайла = ТекСтрока.НомерСтроки;
			НоваяЗаправка.ТипОперации      = ТипОперации;
			НоваяЗаправка.ТС               = ТС;
		КонецЦикла;  
		Объект.Расходы.Сортировать("НомерСтрокиФайла");
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКартуСохранитьИзменения(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если Не РезультатВопроса = КодВозвратаДиалога.Да Тогда 
		Возврат;
	КонецЕсли;
	
	Если Не ПроверитьЗаполнение() Тогда 
		Возврат;
	КонецЕсли;
	
	Записать();
	ОткрытьФормуКарты(ДополнительныеПараметры.ТекДанные);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура НайтиСоздатьОперациюПлатон(ТипОперацииМассив, ТипОперацииСоответствие)
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("ТипОперацииМассив", ТипОперацииМассив);
	Запрос.Текст = "ВЫБРАТЬ
	               |	уатТипыОперацийПлатон.Ссылка КАК Ссылка,
	               |	уатТипыОперацийПлатон.Наименование
	               |ИЗ
	               |	Справочник.уатТипыОперацийПлатон КАК уатТипыОперацийПлатон
	               |ГДЕ
	               |	уатТипыОперацийПлатон.Наименование В(&ТипОперацииМассив)";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ТипОперацииСоответствие.Вставить(Выборка.Наименование, Выборка.Ссылка);
	КонецЦикла;
	Для Каждого ТекСтрока Из ТипОперацииСоответствие Цикл
		Если НЕ ЗначениеЗаполнено(ТекСтрока.Значение) Тогда
			ТипОперацииСсылка = Справочники.уатТипыОперацийПлатон.СоздатьЭлемент();
			ТипОперацииСсылка.Заполнить(Неопределено);
			ТипОперацииСсылка.Наименование = ТекСтрока.Ключ;
			ТипОперацииСсылка.Записать();
			ТипОперацииСсылка = ТипОперацииСсылка.Ссылка;
			ТипОперацииСоответствие.Вставить(ТекСтрока.Ключ, ТипОперацииСсылка);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуКарты(ТекДанные)
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("РежимОткрытия",       "РежимКарты_ОтчетСистемыПлатон");
	ПараметрыФормы.Вставить("Документ",            Объект.Ссылка);
	ПараметрыФормы.Вставить("ШиротаВъезда",        ТекДанные.ЛатВъездаНаТарифицируемыйУчасток);
	ПараметрыФормы.Вставить("ДолготаВъезда",       ТекДанные.ЛонВъездаНаТарифицируемыйУчасток);
	ПараметрыФормы.Вставить("ШиротаСъезда",        ТекДанные.ЛатСъездаСТарифицируемогоУчастка);
	ПараметрыФормы.Вставить("ДолготаСъезда",       ТекДанные.ЛонСъездаСТарифицируемогоУчастка);
	
	уатЭлектронныеКартыКлиент.ОткрытьКартуИУстановитьРежим(ПараметрыФормы);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьНомерБортовогоУстройстваТССервер(Знач Расходы)
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	тТС.ТС КАК ТС,
	               |	тТС.НомерБУМК КАК НомерБУМК,
	               |	тТС.ДатаОперации КАК ДатаОперации
	               |ПОМЕСТИТЬ втТС
	               |ИЗ
	               |	&тТС КАК тТС
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	уатТС.Ссылка КАК Ссылка,
	               |	втТС.НомерБУМК КАК НомерБУМК,
	               |	втТС.ДатаОперации КАК ДатаОперации
	               |ИЗ
	               |	Справочник.уатТС КАК уатТС
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втТС КАК втТС
	               |		ПО уатТС.Ссылка = втТС.ТС
	               |			И (уатТС.НомерБортовогоУстройстваПлатон = """")
	               |			И (втТС.НомерБУМК <> """")";
	
	Запрос.УстановитьПараметр("тТС", Расходы.Выгрузить());
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СправочникОбъект = Выборка.Ссылка.ПолучитьОбъект();
		СправочникОбъект.НомерБортовогоУстройстваПлатон = Выборка.НомерБУМК;
		СправочникОбъект.ДополнительныеСвойства.Вставить("ДатаОперации", Выборка.ДатаОперации);
		СправочникОбъект.ДополнительныеСвойства.Вставить("ЗаписьНомераБортовогоУстройтваТС", Истина);
		Попытка
			СправочникОбъект.Записать();
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииКонтрагентаИлиОрганизации()
	
	ДанныеОбменаССервером = Новый Структура("Организация, Контрагент, ДоговорКонтрагента, Дата");
	ЗаполнитьЗначенияСвойств(ДанныеОбменаССервером, Объект);
	
	// Получим данные с сервера
	ДанныеОбменаССервером.ДоговорКонтрагента = Объект.ДоговорКонтрагента;
	ЗначенияДляЗаполнения = ИзменениеКонтрагентаСервер(ДанныеОбменаССервером);
	Объект.ДоговорКонтрагента = ЗначенияДляЗаполнения.ДоговорКонтрагента;
	
	ДоговорПередИзменением = Договор;
	Договор = Объект.ДоговорКонтрагента;
	
	УстановитьСвязиПараметровВыбора();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСвязиПараметровВыбора()
	
	НовыйМассив = Новый Массив();
	
	НоваяСвязь = Новый СвязьПараметраВыбора("Отбор.Организация", "Объект.Организация");
	НовыйМассив.Добавить(НоваяСвязь);
	
	НоваяСвязь = Новый СвязьПараметраВыбора("Отбор.Владелец", "Объект.Контрагент");
	НовыйМассив.Добавить(НоваяСвязь);
	
	Элементы.ДоговорКонтрагента.СвязиПараметровВыбора = Новый ФиксированныйМассив(НовыйМассив);

КонецПроцедуры


&НаСервереБезКонтекста
Функция ИзменениеКонтрагентаСервер(ДанныеДляЗаполнения)
	СтруктураПараметровДляПолученияДоговора =
		уатЗаполнениеДокументов.ПолучитьСтруктуруПараметровДляПолученияДоговораПокупки();
	
	ЗначенияДляЗаполнения = уатОбщегоНазначенияСервер.ПриИзмененииЗначенияКонтрагента(ДанныеДляЗаполнения,
							СтруктураПараметровДляПолученияДоговора);
	Возврат ЗначенияДляЗаполнения;
КонецФункции

&НаКлиенте
Процедура ПриИзмененииДоговора()
	
	Если Не ЗначениеЗаполнено(Объект.Организация) Тогда
		Объект.Организация = уатОбщегоНазначенияТиповыеСервер.ПолучитьЗначениеРеквизита(Объект.ДоговорКонтрагента, "Организация");
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Контрагент) Тогда
		Объект.Контрагент = уатОбщегоНазначенияТиповыеСервер.ПолучитьЗначениеРеквизита(Объект.ДоговорКонтрагента, "Владелец");
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Функция НайтиТСПоНомеруУстройства(ДатаОперации, НомерУстройства)
	
	ТС = Справочники.уатТС.ПустаяСсылка();
	СтруктураОтбора = Новый Структура("ВнешняяСистема", Справочники.уатВнешниеСистемы.Платон);
	
	ЗаписьРегистра = РегистрыСведений.уатИсторияЗакрепленияБортовыхУстройств.СрезПоследних(ДатаОперации, СтруктураОтбора);
	
	Для Каждого ТекСтрока Из ЗаписьРегистра Цикл
		
		Если ТекСтрока.НомерБортовогоУстройства = НомерУстройства Тогда
			ТС = ТекСтрока.ТС;
		КонецЕсли;
		
	КонецЦикла;
		
	Возврат ТС;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьСоответвиеТСПоНомерамУстройств(МассивНомеровБортовогоУстройства)
	СоответвиеБортовыхУстройств = Новый Соответствие();
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("ВнешняяСистема", Справочники.уатВнешниеСистемы.Платон);
	Запрос.УстановитьПараметр("МассивНомеровБортовогоУстройства", МассивНомеровБортовогоУстройства);
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	уатИсторияЗакрепленияБортовыхУстройств.ТС КАК ТС,
	               |	ВЫРАЗИТЬ(уатИсторияЗакрепленияБортовыхУстройств.НомерБортовогоУстройства КАК СТРОКА(150)) КАК НомерБортовогоУстройства,
	               |	уатИсторияЗакрепленияБортовыхУстройств.Период КАК Период
	               |ИЗ
	               |	РегистрСведений.уатИсторияЗакрепленияБортовыхУстройств КАК уатИсторияЗакрепленияБортовыхУстройств
	               |ГДЕ
	               |	уатИсторияЗакрепленияБортовыхУстройств.ВнешняяСистема = &ВнешняяСистема
	               |	И ВЫРАЗИТЬ(уатИсторияЗакрепленияБортовыхУстройств.НомерБортовогоУстройства КАК СТРОКА(150)) В (&МассивНомеровБортовогоУстройства)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	НомерБортовогоУстройства,
	               |	Период
	               |ИТОГИ ПО
	               |	НомерБортовогоУстройства";
	
	МассивТС  = Новый Массив();
	ВыборкаТС = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаТС.Следующий() Цикл
		ВыборкаПериодов = ВыборкаТС.Выбрать();
		
		СоответвиеДат = Новый Соответствие();
		Пока ВыборкаПериодов.Следующий() Цикл
			СоответвиеДат.Вставить(ВыборкаПериодов.Период, ВыборкаПериодов.ТС);
			
			МассивТС.Добавить(ВыборкаПериодов.ТС);
		КонецЦикла;
		СоответвиеБортовыхУстройств.Вставить(ВыборкаТС.НомерБортовогоУстройства, СоответвиеДат);
	КонецЦикла;
	
	СоответвиеТС = Новый Соответствие();
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("ВнешняяСистема", Справочники.уатВнешниеСистемы.Платон);
	Запрос.УстановитьПараметр("МассивТС", МассивТС);
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	уатИсторияЗакрепленияБортовыхУстройств.ТС КАК ТС,
	               |	ВЫРАЗИТЬ(уатИсторияЗакрепленияБортовыхУстройств.НомерБортовогоУстройства КАК СТРОКА(150)) КАК НомерБортовогоУстройства,
	               |	уатИсторияЗакрепленияБортовыхУстройств.Период КАК Период
	               |ИЗ
	               |	РегистрСведений.уатИсторияЗакрепленияБортовыхУстройств КАК уатИсторияЗакрепленияБортовыхУстройств
	               |ГДЕ
	               |	уатИсторияЗакрепленияБортовыхУстройств.ВнешняяСистема = &ВнешняяСистема
	               |	И уатИсторияЗакрепленияБортовыхУстройств.ТС В(&МассивТС)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ТС,
	               |	Период
	               |ИТОГИ ПО
	               |	ТС";
    ВыборкаТС = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаТС.Следующий() Цикл
		ВыборкаПериодов = ВыборкаТС.Выбрать();
		
		СоответвиеДат = Новый Соответствие();
		Пока ВыборкаПериодов.Следующий() Цикл
			СоответвиеДат.Вставить(ВыборкаПериодов.Период, ВыборкаПериодов.НомерБортовогоУстройства);
		КонецЦикла;
		СоответвиеТС.Вставить(ВыборкаТС.ТС, СоответвиеДат);
	КонецЦикла;
	
	СтруктураДанных = Новый Структура("СоответвиеБортовыхУстройств, СоответвиеТС", 
		СоответвиеБортовыхУстройств, СоответвиеТС); 
	Возврат СтруктураДанных;
	
КонецФункции

#КонецОбласти
